# Version:1.0 MMMC View Definition File
# Do Not Remove Above Line
create_rc_corner -name SS -cap_table {/h/dc/o/si3116uw-s/icp1matrix/PnR/jollof_top.dat/libs/mmmc/cmos065_7m4x0y2z_AP_Worst.captable} -T {125} -preRoute_res {1} -preRoute_cap {1} -preRoute_clkres {0} -preRoute_clkcap {0} -postRoute_res {1 1 1} -postRoute_cap {1 1 1} -postRoute_xcap {1 1 1} -postRoute_clkres {0 0 0} -postRoute_clkcap {0 0 0} -qx_tech_file {/h/dc/o/si3116uw-s/icp1matrix/PnR/jollof_top.dat/libs/mmmc/SS/RCMIN.tech}
create_rc_corner -name FF -cap_table {/h/dc/o/si3116uw-s/icp1matrix/PnR/jollof_top.dat/libs/mmmc/cmos065_7m4x0y2z_AP_Best.captable} -T {-40} -preRoute_res {1} -preRoute_cap {1} -preRoute_clkres {0} -preRoute_clkcap {0} -postRoute_res {1 1 1} -postRoute_cap {1 1 1} -postRoute_xcap {1 1 1} -postRoute_clkres {0 0 0} -postRoute_clkcap {0 0 0} -qx_tech_file {/h/dc/o/si3116uw-s/icp1matrix/PnR/jollof_top.dat/libs/mmmc/FF/RCMAX.tech}
create_op_cond -name WCCOM -library_file {/h/dc/o/si3116uw-s/icp1matrix/PnR/jollof_top.dat/libs/mmmc/CORE65LPLVT_wc_0.95V_125C_10y.lib} -P {1} -V {0.95} -T {125}
create_op_cond -name BCCOM -library_file {/h/dc/o/si3116uw-s/icp1matrix/PnR/jollof_top.dat/libs/mmmc/CORE65LPLVT_bc_1.30V_m40C_10y.lib} -P {1} -V {1.3} -T {-40}
create_library_set -name SS -timing {/h/dc/o/si3116uw-s/icp1matrix/PnR/jollof_top.dat/libs/mmmc/CLOCK65LPLVT_wc_0.95V_125C_10y.lib /h/dc/o/si3116uw-s/icp1matrix/PnR/jollof_top.dat/libs/mmmc/CORE65LPLVT_wc_0.95V_125C_10y.lib /h/dc/o/si3116uw-s/icp1matrix/PnR/jollof_top.dat/libs/mmmc/IO65LP_SF_BASIC_50A_ST_7M4X0Y2Z_wc_0.95V_125C_10y.lib /h/dc/o/si3116uw-s/icp1matrix/PnR/jollof_top.dat/libs/mmmc/IO65LPHVT_SF_1V8_50A_7M4X0Y2Z_wc_0.95V_1.65V_125C_10y.lib /h/dc/o/si3116uw-s/icp1matrix/PnR/jollof_top.dat/libs/mmmc/SPHD110420_wc_1.10V_125C_10y.lib /usr/local-eit/cad2/cmpstm/dicp18/lu_pads_65nm/Pads_Oct2012.lib}
create_library_set -name FF -timing {/h/dc/o/si3116uw-s/icp1matrix/PnR/jollof_top.dat/libs/mmmc/CLOCK65LPLVT_bc_1.30V_m40C_10y.lib /h/dc/o/si3116uw-s/icp1matrix/PnR/jollof_top.dat/libs/mmmc/CORE65LPLVT_bc_1.30V_m40C_10y.lib /h/dc/o/si3116uw-s/icp1matrix/PnR/jollof_top.dat/libs/mmmc/IO65LP_SF_BASIC_50A_ST_7M4X0Y2Z_bc_1.30V_m40C_10y.lib /h/dc/o/si3116uw-s/icp1matrix/PnR/jollof_top.dat/libs/mmmc/IO65LPHVT_SF_1V8_50A_7M4X0Y2Z_bc_1.30V_1.95V_m40C_10y.lib /h/dc/o/si3116uw-s/icp1matrix/PnR/jollof_top.dat/libs/mmmc/SPHD110420_bc_1.30V_m40C_10y.lib /usr/local-eit/cad2/cmpstm/dicp18/lu_pads_65nm/Pads_Oct2012.lib}
create_constraint_mode -name Clock_Constraint -sdc_files {/h/dc/o/si3116uw-s/icp1matrix/outputs/jollof_top.sdc}
create_delay_corner -name SS -library_set {SS} -opcond_library {/h/dc/o/si3116uw-s/icp1matrix/PnR/jollof_top.dat/libs/mmmc/CORE65LPLVT_wc_0.95V_125C_10y.lib} -opcond {WCCOM} -rc_corner {SS}
create_delay_corner -name FF -library_set {FF} -opcond_library {/h/dc/o/si3116uw-s/icp1matrix/PnR/jollof_top.dat/libs/mmmc/CORE65LPLVT_bc_1.30V_m40C_10y.lib} -opcond {BCCOM} -rc_corner {FF}
create_analysis_view -name SS -constraint_mode {Clock_Constraint} -delay_corner {SS}
create_analysis_view -name FF -constraint_mode {Clock_Constraint} -delay_corner {FF}
set_analysis_view -setup {SS} -hold {FF}
